Documents/РеализацияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>РеализацияОС</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеОС</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Финансовый</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКонтрагентами</xr:Item>
				<xr:Item>InformationRegister.СостояниеОС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыгружатьВБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРасчетаНДС</Name>
					<Comment>Вариант расчета НДС!</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДР90счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДР44</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстаточнаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстаточнаяАмортизация</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеПринятоКУчету</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccountingRegisters/Финансовый.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccountingRegister>
		<Properties>
			<Name>Финансовый</Name>
			<Comment>(Упр)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Финансовый</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Финансовый.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Финансовый.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Финансовый.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Финансовый.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Финансовый.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Финансовый.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаМСФО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СторонаПроводкиДляПересчетаПоСебестоимости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

InformationRegisters/СостояниеОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СостояниеОС</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Местоположение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Эксплуатируется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Списано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПринятыеКУчетуОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПринятыеКУчетуОС</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВводаВЭксплуатацию</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачальнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьАмортизацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаАмортизация</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Финансовый</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Финансовый</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АмортизационнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АмортизационныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоОприходование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяДР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыРасчетаНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВариантыРасчетаНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДСсверху</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСвТомЧисле</Name>
					<Comment>Входит с стоимость</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РеализацияОС/Ext/ObjectModule.bsl
Функция РассчитатьАмортизациюНаЛету(СписокОС)
	
	Возврат АК_ОсновныеСредства.РассчитатьАмортизациюНаЛету(СписокОС, Организация, Дата);
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ФинансовыйОбороты.Субконто1 КАК ОсновноеСредство,
	//               |	ФинансовыйОбороты.СуммаОстаток КАК СуммаОборотПо01,
	//               |	ПринятыеКУчетуОССрезПоследних.НачислятьАмортизацию,
	//               |	ПринятыеКУчетуОССрезПоследних.СрокАмортизации,
	//               |	ПринятыеКУчетуОССрезПоследних.ЭтоОприходование
	//               |ПОМЕСТИТЬ Сводная
	//               |ИЗ
	//               |	РегистрБухгалтерии.Финансовый.Остатки(
	//               |			&КонецПериода,
	//               |			Счет = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.ОсновныеСредстваВОрганизации)
	//               |				ИЛИ Счет = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.ОсновныеСредстваДо100000),
	//               |			,
	//               |			Организация = &Организация
	//               |				И Субконто1 В (&СписокОС)) КАК ФинансовыйОбороты
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПринятыеКУчетуОС.СрезПоследних(&КонецПериода, ) КАК ПринятыеКУчетуОССрезПоследних
	//               |		ПО ФинансовыйОбороты.Субконто1 = ПринятыеКУчетуОССрезПоследних.ОсновноеСредство
	//               |			И ФинансовыйОбороты.Организация = ПринятыеКУчетуОССрезПоследних.Организация
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	Сводная.ОсновноеСредство,
	//               |	Сводная.СуммаОборотПо01 КАК НачальнаяСтоимость,
	//               |	Сводная.НачислятьАмортизацию,
	//               |	Сводная.СрокАмортизации,
	//               |	Сводная.ЭтоОприходование
	//               |ПОМЕСТИТЬ ПринятыеКУчетуОССрассчитаннойСтоимостью
	//               |ИЗ
	//               |	Сводная КАК Сводная
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ПринятыеКУчетуОССрезПоследних.ОсновноеСредство,
	//               |	ПринятыеКУчетуОССрезПоследних.НачальнаяСтоимость / ПринятыеКУчетуОССрезПоследних.СрокАмортизации КАК СуммаСписанияЗаМесяц,
	//               |	ЕСТЬNULL(ПринятыеКУчетуОССрезПоследних.НачальнаяСтоимость, 0) КАК НачальнаяСтоимость,
	//               |	ПринятыеКУчетуОССрезПоследних.СрокАмортизации,
	//               |	ПринятыеКУчетуОССрезПоследних.ЭтоОприходование
	//               |ПОМЕСТИТЬ втПринятыеКУчету
	//               |ИЗ
	//               |	ПринятыеКУчетуОССрассчитаннойСтоимостью КАК ПринятыеКУчетуОССрезПоследних
	//               |ГДЕ
	//               |	ПринятыеКУчетуОССрезПоследних.НачислятьАмортизацию
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ФинансовыйОстатки.Субконто1 КАК ОсновноеСредство,
	//               |	ФинансовыйОстатки.СуммаОстаток КАК Сумма,
	//               |	ФинансовыйОстатки.Счет
	//               |ПОМЕСТИТЬ втСтоимостьОС
	//               |ИЗ
	//               |	РегистрБухгалтерии.Финансовый.Остатки(
	//               |			&ГраницаНачала,
	//               |			Счет = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.ОсновныеСредстваВОрганизации)
	//               |				ИЛИ Счет = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.ОсновныеСредстваДо100000),
	//               |			,
	//               |			Субконто1 В
	//               |				(ВЫБРАТЬ
	//               |					втПринятыеКУчету.ОсновноеСредство
	//               |				ИЗ
	//               |					втПринятыеКУчету)) КАК ФинансовыйОстатки
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	втПринятыеКУчету.ОсновноеСредство,
	//               |	СУММА(ВЫБОР
	//               |			КОГДА ВЫБОР
	//               |					КОГДА втСтоимостьОС.Сумма > 0
	//               |						ТОГДА втСтоимостьОС.Сумма / втПринятыеКУчету.СрокАмортизации
	//               |					ИНАЧЕ втПринятыеКУчету.СуммаСписанияЗаМесяц
	//               |				КОНЕЦ + НачисленноАмортизации.Сумма > втСтоимостьОС.Сумма
	//               |				ТОГДА втСтоимостьОС.Сумма - НачисленноАмортизации.Сумма
	//               |			ИНАЧЕ ВЫБОР
	//               |					КОГДА втСтоимостьОС.Сумма > 0
	//               |						ТОГДА втСтоимостьОС.Сумма / втПринятыеКУчету.СрокАмортизации
	//               |					ИНАЧЕ втПринятыеКУчету.СуммаСписанияЗаМесяц
	//               |				КОНЕЦ
	//               |		КОНЕЦ) КАК Сумма,
	//               |	втСтоимостьОС.Счет,
	//               |	втПринятыеКУчету.ЭтоОприходование
	//               |ИЗ
	//               |	втПринятыеКУчету КАК втПринятыеКУчету
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//               |			ФинансовыйДвиженияССубконто.СубконтоКт1 КАК ОсновноеСредство,
	//               |			СУММА(ЕСТЬNULL(ФинансовыйДвиженияССубконто.Сумма, 0)) КАК Сумма
	//               |		ИЗ
	//               |			РегистрБухгалтерии.Финансовый.ДвиженияССубконто(
	//               |					,
	//               |					&ДатаНачала,
	//               |					СубконтоКт1 В
	//               |							(ВЫБРАТЬ
	//               |								втПринятыеКУчету.ОсновноеСредство
	//               |							ИЗ
	//               |								втПринятыеКУчету)
	//               |						И (СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.АмортизацияОсновныхСредств)
	//               |							ИЛИ СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.АмортизацияОсновныхСредствДо100000)),
	//               |					,
	//               |					) КАК ФинансовыйДвиженияССубконто
	//               |		
	//               |		СГРУППИРОВАТЬ ПО
	//               |			ФинансовыйДвиженияССубконто.СубконтоКт1) КАК НачисленноАмортизации
	//               |		ПО втПринятыеКУчету.ОсновноеСредство = НачисленноАмортизации.ОсновноеСредство
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ втСтоимостьОС КАК втСтоимостьОС
	//               |		ПО втПринятыеКУчету.ОсновноеСредство = втСтоимостьОС.ОсновноеСредство
	//               |ГДЕ
	//               |	ЕСТЬNULL(втПринятыеКУчету.НачальнаяСтоимость, 0) > ЕСТЬNULL(НачисленноАмортизации.Сумма, 0)
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	втПринятыеКУчету.ОсновноеСредство,
	//               |	втСтоимостьОС.Счет,
	//               |	втПринятыеКУчету.ЭтоОприходование";
	//
	//Запрос.УстановитьПараметр("Организация", Организация);
	//Запрос.УстановитьПараметр("СписокОС", СписокОС);
	//
	//ГраницаНачала = Новый Граница(Началомесяца(Дата),ВидГраницы.Включая);
	//Запрос.УстановитьПараметр("ГраницаНачала", ГраницаНачала);

	//Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Дата));
	//
	//Граница = Новый Граница(НачалоМесяца(Дата),ВидГраницы.Исключая);	
	//Запрос.УстановитьПараметр("КонецПериода", Граница); 
	//
	//Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

Функция ПолучитьОстаткиПоОССервер(СписокОС, ТолькоПолучитьСчетУчета = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ФинансовыйОстатки.Счет В ИЕРАРХИИ (&СчетаАмортизации)
	               |			ТОГДА -ФинансовыйОстатки.СуммаОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОстатокАмортизации,
	               |	ВЫБОР
	               |		КОГДА ФинансовыйОстатки.Счет В ИЕРАРХИИ (&СчетаУчетаОС, ЗНАЧЕНИЕ(ПланСчетов.Финансовый.ПриобретениеОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.ПриобретениеОсновныхСредствДо100000))
	               |			ТОГДА ФинансовыйОстатки.СуммаОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОстатокПоОС,
	               |	ВЫБОР
	               |		КОГДА ФинансовыйОстатки.Счет В (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.ПриобретениеОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.ПриобретениеОсновныхСредствДо100000))
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК НеПринятоКУчету,
	               |	ФинансовыйОстатки.Субконто1 КАК ОС,
	               |	ФинансовыйОстатки.Счет
	               |ПОМЕСТИТЬ Сводная
	               |ИЗ
	               |	РегистрБухгалтерии.Финансовый.Остатки(
	               |			&Период,
	               |			Счет В ИЕРАРХИИ (&СписокСчетов, ЗНАЧЕНИЕ(ПланСчетов.Финансовый.ПриобретениеОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.ПриобретениеОсновныхСредствДо100000)),
	               |			,
	               |			Субконто1 В (&СписокОС)
	               |				И Организация = &Организация) КАК ФинансовыйОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(Сводная.ОстатокАмортизации) КАК ОстатокАмортизации,
	               |	СУММА(Сводная.ОстатокПоОС) КАК ОстатокПоОС,
	               |	Сводная.ОС,
	               |	МАКСИМУМ(Сводная.НеПринятоКУчету) КАК НеПринятоКУчету,
	               |	МАКСИМУМ(Сводная.Счет) КАК Счет
	               |ИЗ
	               |	Сводная КАК Сводная
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Сводная.ОС";
	
	СписокСчетов = Новый Массив;
	СписокСчетов.Добавить(ПланыСчетов.Финансовый.ОсновныеСредстваВОрганизации);
	СписокСчетов.Добавить(ПланыСчетов.Финансовый.АмортизацияОсновныхСредств);		
	
	СчетаАмортизации = Новый Массив;
	СчетаАмортизации.Добавить(ПланыСчетов.Финансовый.АмортизацияОсновныхСредств);
		
	СчетаУчетаОС = Новый Массив;
	СчетаУчетаОС.Добавить(ПланыСчетов.Финансовый.ОсновныеСредстваВОрганизации);
		
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
	Запрос.УстановитьПараметр("СчетаУчетаОС", СчетаУчетаОС);
	Запрос.УстановитьПараметр("СчетаАмортизации", СчетаАмортизации);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("СписокОС", СписокОС);
	Запрос.УстановитьПараметр("Организация", Организация); 
		
	ТаблицаДанныеОС = Запрос.Выполнить().Выгрузить();
	
	Если НЕ ТолькоПолучитьСчетУчета Тогда
		ТаблицаАмортизации = РассчитатьАмортизациюНаЛету(СписокОС);	
		ТаблицаАмортизации.Индексы.Добавить("ОсновноеСредство");
	
		Для Каждого Стр Из ТаблицаДанныеОС Цикл
			НайдСтр = ТаблицаАмортизации.Найти(Стр.ОС, "ОсновноеСредство");
		
			Если НайдСтр <> Неопределено Тогда
				Стр.ОстатокАмортизации = Стр.ОстатокАмортизации + НайдСтр.Сумма;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаДанныеОС;	
	
КонецФункции

Функция ПроверитьЗадвоения()
	
	тзНоменклатура = ОсновныеСредства.Выгрузить();
	тзНоменклатура.Свернуть("ОсновноеСредство");
	Если тзНоменклатура.Количество() = ОсновныеСредства.Количество() Тогда
		Возврат Истина;
	КонецЕсли;

	тзНоменклатура.Колонки.Добавить("Количество");
	тзНоменклатура.ЗаполнитьЗначения(0, "Количество");
	Для Каждого Строка Из ОсновныеСредства Цикл
		пСтрока = тзНоменклатура.Найти(Строка.ОсновноеСредство, "ОсновноеСредство");
		пСтрока.Количество = пСтрока.Количество + 1;
	КонецЦикла;
	
	ОбщегоНазначения.СообщитьОбОшибке("", Истина, "В табличной части имеются задвоения:");
	Для Каждого Строка Из ОсновныеСредства Цикл
		пСтрока = тзНоменклатура.Найти(Строка.ОсновноеСредство, "ОсновноеСредство");
		Если пСтрока.Количество > 1 Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Строка № " + Строка.НомерСтроки + " (" + Строка.ОсновноеСредство + ")", Истина);	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//+++АК Susk (Суслин К.В.) 2018.05.11 ИП-00018664	 
	//ЭтотОбъект.СуммаДокумента = ЭтотОбъект.ОсновныеСредства.Итог("Сумма");	
	СуммаДокумента = ОсновныеСредства.Итог("Сумма") + ?(ВариантРасчетаНДС = Перечисления.ВариантыРасчетаНДС.НДСсверху, ОсновныеСредства.Итог("СуммаНДС"), 0);
	//---АК Susk (Суслин К.В.) 
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("Организация");
	ПроверяемыеРеквизиты.Добавить("Контрагент");
	ПроверяемыеРеквизиты.Добавить("ДоговорКонтрагента");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем Заголовок;
	
	// Проверка ручной корректировки
	Если ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(ЭтотОбъект.РучнаяКорректировка, Отказ, Заголовок, ЭтотОбъект) Тогда
		Возврат
	КонецЕсли;
	
	Если НЕ ПроверитьЗадвоения() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияПоРегистрам(Отказ)
	
	ДвиженияФинансовый(Отказ);
	ДвиженияСнятиеСУчета(Отказ);
	ДвиженияРасчетыСКонтрагентами(Отказ);
	
КонецПроцедуры

Процедура ДвиженияФинансовый(Отказ)
	
	Движения.Финансовый.Записывать = Истина;
	
	Счет_01_9 = ПланыСчетов.Финансовый.НайтиПоКоду("01.9");
	Счет_44_5 = ПланыСчетов.Финансовый.НайтиПоКоду("44.5");
	Счет_96_1 = ПланыСчетов.Финансовый.НайтиПоКоду("96.1");
	
	ВидНалогаНДС = Справочники.ВидыНалогов.НайтиПоНаименованию("НДС");
	
	Если Документы.РеализацияОС.ВГО(Контрагент) Тогда
	
		Для Каждого Стр Из ОсновныеСредства Цикл
		
			//62.ВГ-96.1
			Движение = Движения.Финансовый.Добавить();
			Движение.СчетДт = ПланыСчетов.Финансовый.ВГОРасчетыСПокупателями;
			Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[0].ВидСубконто] = Организация;
			Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[1].ВидСубконто] = Контрагент;
			Движение.СчетКт = Счет_96_1;
			Движение.СубконтоКт[Движение.СчетКт.ВидыСубконто[0].ВидСубконто] = Стр.СтруктурнаяЕдиница;
			Движение.СубконтоКт[Движение.СчетКт.ВидыСубконто[1].ВидСубконто] = СтатьяДР90счет;
			Движение.СубконтоКт[Движение.СчетКт.ВидыСубконто[2].ВидСубконто] = ЦФО;
			Движение.Сумма = Стр.Сумма;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Содержание = "Реализация ОС";
			
			//01.9-01
			Движение = Движения.Финансовый.Добавить();
			Движение.СчетДт = Счет_01_9;
			Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[0].ВидСубконто] = Стр.ОсновноеСредство;
			Движение.СчетКт = ПланыСчетов.Финансовый.ОсновныеСредстваВОрганизации;
			Движение.СубконтоКт[Движение.СчетКт.ВидыСубконто[0].ВидСубконто] = Стр.ОсновноеСредство;
			Движение.Сумма = Стр.ОстаточнаяСтоимость;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Содержание = "Реализация ОС";
			
			//02-01.9
			Если ЗначениеЗаполнено(Стр.ОстаточнаяАмортизация) Тогда
				Движение = Движения.Финансовый.Добавить();
				Движение.СчетДт = ПланыСчетов.Финансовый.АмортизацияОсновныхСредств;
				Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[0].ВидСубконто] = Стр.ОсновноеСредство;
				Движение.СчетКт = Счет_01_9;
				Движение.СубконтоКт[Движение.СчетКт.ВидыСубконто[0].ВидСубконто] = Стр.ОсновноеСредство;
				Движение.Сумма = Стр.ОстаточнаяАмортизация;
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.Содержание = "Реализация ОС";
			КонецЕсли;
			
			//44.5-01.9
			Движение = Движения.Финансовый.Добавить();
			Движение.СчетДт = Счет_44_5;
			
			//+++АК VERT 2018.06.19 по просьбе Чиркова Н. для 44 счета должна быть структурная единица всегда
			Если ТипЗнч(Стр.СтруктурнаяЕдиница) = Тип("СправочникСсылка.Склады") Тогда 
				СтруктурнаяЕдиница = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.СтруктурнаяЕдиница, "Владелец");
			Иначе
				СтруктурнаяЕдиница = Стр.СтруктурнаяЕдиница;
			КонецЕсли;
			Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[0].ВидСубконто] = СтруктурнаяЕдиница;
			Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[1].ВидСубконто] = СтатьяДР44;
			Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[2].ВидСубконто] = ЦФО;
			Движение.СчетКт = Счет_01_9;
			Движение.СубконтоКт[Движение.СчетКт.ВидыСубконто[0].ВидСубконто] = Стр.ОсновноеСредство;
			Движение.Сумма = Стр.ОстаточнаяСтоимость - Стр.ОстаточнаяАмортизация;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Содержание = "Реализация ОС";
			
			//НДС			
			Движение = Движения.Финансовый.Добавить();
			Движение.СчетДт = Счет_96_1;
			Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[0].ВидСубконто] = Стр.СтруктурнаяЕдиница;
			Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[1].ВидСубконто] = СтатьяДР90счет;
			Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[2].ВидСубконто] = ЦФО;
			Движение.СчетКт = ПланыСчетов.Финансовый.НалогиУН; //68.2
			Движение.СубконтоКт[Движение.СчетКт.ВидыСубконто[0].ВидСубконто] = Организация;
			Движение.СубконтоКт[Движение.СчетКт.ВидыСубконто[1].ВидСубконто] = ВидНалогаНДС;
			Движение.СубконтоКт[Движение.СчетКт.ВидыСубконто[2].ВидСубконто] = Стр.СтавкаНДС;			
			Движение.Сумма = Стр.СуммаНДС;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Содержание = "Реализация ОС";
				
		КонецЦикла;	
		
	Иначе
		
		СписокОС = ОсновныеСредства.ВыгрузитьКолонку("ОсновноеСредство");
		
		ТаблицаПринятыхКУчетуОС = ПолучитьТаблицуПринятыхКУчетуОС(СписокОС);
		ТаблицаОстатков = ПолучитьОстаткиПоОССервер(СписокОС, Истина);
		
		Для Каждого Стр Из ОсновныеСредства Цикл
			
			Если Стр.СтруктурнаяЕдиница = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("bee01d02-4cf5-11e3-979d-005056a00106")) Тогда //Склад_оборудование меняю на стр.ед
				СтруктЕд = Справочники.СтруктурныеЕдиницы.ПолучитьСсылку(Новый УникальныйИдентификатор("49138a04-cdee-11e7-8383-005056a0779c")); //Склад оборудование
			Иначе
				СтруктЕд = Стр.СтруктурнаяЕдиница;
			КонецЕсли;		
			
		
			//62.1-90.5
			Движение = Движения.Финансовый.Добавить();
			Движение.СчетДт = ПланыСчетов.Финансовый.РасчетыСПокупателямиПрочие;
			Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[0].ВидСубконто] = Организация;
			Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[1].ВидСубконто] = Контрагент;
			Движение.СчетКт = ПланыСчетов.Финансовый.ВыручкаПрочая;
			Движение.СубконтоКт[Движение.СчетКт.ВидыСубконто[0].ВидСубконто] = СтруктЕд;
			Движение.СубконтоКт[Движение.СчетКт.ВидыСубконто[1].ВидСубконто] = СтатьяДР90счет;
			Движение.СубконтоКт[Движение.СчетКт.ВидыСубконто[2].ВидСубконто] = ЦФО;
			Движение.Сумма = ?(ВариантРасчетаНДС = Перечисления.ВариантыРасчетаНДС.БезНДС, Стр.Сумма, Стр.Сумма + Стр.СуммаНДС); // в Передаче ОС в бухе 62 счет идет + НДС
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Содержание = "Реализация ОС";
			
			//НДС			
			Движение = Движения.Финансовый.Добавить();
			Движение.СчетДт = ПланыСчетов.Финансовый.ВыручкаПрочая;
			Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[0].ВидСубконто] = СтруктЕд;
			Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[1].ВидСубконто] = СтатьяДР90счет;
			Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[2].ВидСубконто] = ЦФО;
			Движение.СчетКт = ПланыСчетов.Финансовый.НалогиУН;
			Движение.СубконтоКт[Движение.СчетКт.ВидыСубконто[0].ВидСубконто] = Организация;
			Движение.СубконтоКт[Движение.СчетКт.ВидыСубконто[1].ВидСубконто] = ВидНалогаНДС;
			Движение.СубконтоКт[Движение.СчетКт.ВидыСубконто[2].ВидСубконто] = Стр.СтавкаНДС;			
			Движение.Сумма = Стр.СуммаНДС;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Содержание = "Реализация ОС";
			
			НайдСтр = ТаблицаПринятыхКУчетуОС.Найти(Стр.ОсновноеСредство, "ОсновноеСредство");
			
			ОСПринятоКУчету = НайдСтр <> Неопределено;
			
			Если ОСПринятоКУчету Тогда
				
				//01.9-01
				Движение = Движения.Финансовый.Добавить();
				Движение.СчетДт = Счет_01_9;
				Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[0].ВидСубконто] = Стр.ОсновноеСредство;
				Движение.СчетКт = ПланыСчетов.Финансовый.ОсновныеСредстваВОрганизации;
				Движение.СубконтоКт[Движение.СчетКт.ВидыСубконто[0].ВидСубконто] = Стр.ОсновноеСредство;
				Движение.Сумма = Стр.ОстаточнаяСтоимость;
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.Содержание = "Реализация ОС";
				
				//02-01.9
				Если ЗначениеЗаполнено(Стр.ОстаточнаяАмортизация) Тогда
					Движение = Движения.Финансовый.Добавить();
					Движение.СчетДт = ПланыСчетов.Финансовый.АмортизацияОсновныхСредств;
					Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[0].ВидСубконто] = Стр.ОсновноеСредство;
					Движение.СчетКт = Счет_01_9;
					Движение.СубконтоКт[Движение.СчетКт.ВидыСубконто[0].ВидСубконто] = Стр.ОсновноеСредство;
					Движение.Сумма = Стр.ОстаточнаяАмортизация;
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.Содержание = "Реализация ОС";
				КонецЕсли;
				
			КонецЕсли;
			
			//44.5-01.9
			//+++АК VERT 2018.06.19 по просьбе Чиркова Н. для 44 счета должна быть структурная единица всегда
			Если ТипЗнч(Стр.СтруктурнаяЕдиница) = Тип("СправочникСсылка.Склады") Тогда 
				СтруктурнаяЕдиница = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.СтруктурнаяЕдиница, "Владелец");
			Иначе
				СтруктурнаяЕдиница = Стр.СтруктурнаяЕдиница;
			КонецЕсли;

			Движение = Движения.Финансовый.Добавить();
			Движение.СчетДт = Счет_44_5;
			Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[0].ВидСубконто] = СтруктурнаяЕдиница;
			Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[1].ВидСубконто] = СтатьяДР44;
			Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[2].ВидСубконто] = ЦФО;			
			
			НайдСтрОстаток = ТаблицаОстатков.Найти(Стр.ОсновноеСредство, "ОС");
			
			Если ОСПринятоКУчету Тогда
				СчетКт = Счет_01_9;
			Иначе				
				НайдСтрОстаток = ТаблицаОстатков.Найти(Стр.ОсновноеСредство, "ОС");
			
				Если НайдСтрОстаток = Неопределено Тогда
					ОбщегоНазначения.СообщитьОбОшибке("Не удалось найти остаток по счетам для ОС: " + Строка(Стр.ОсновноеСредство) + ", " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ОсновноеСредство, "ИнвентарныйНомер"));
					Возврат;
				КонецЕсли;
				
				СчетКт = НайдСтрОстаток.Счет; 
				
			КонецЕсли;
			
			Движение.СчетКт = СчетКт;
			Движение.СубконтоКт[Движение.СчетКт.ВидыСубконто[0].ВидСубконто] = Стр.ОсновноеСредство;
			Движение.Сумма = Стр.ОстаточнаяСтоимость - Стр.ОстаточнаяАмортизация;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Содержание = "Реализация ОС";			
							
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияСнятиеСУчета(Отказ)
	
	Движения.СостояниеОС.Записывать = Истина;
	
	Для Каждого Стр Из ОсновныеСредства Цикл
		НовДвиж = Движения.СостояниеОС.Добавить();
		НовДвиж.Период = Дата;
		НовДвиж.ОсновноеСредство = Стр.ОсновноеСредство;
		НовДвиж.Местоположение = Стр.СтруктурнаяЕдиница;
		НовДвиж.Списано = Истина;
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ДвиженияРасчетыСКонтрагентами(Отказ)
	//
	//Движения.РасчетыСКонтрагентами.Записывать = Истина;
	//
	//Движение = Движения.РасчетыСКонтрагентами.Добавить();
	//Движение.Период = Дата;
	//Движение.Организация = Организация;
	//Движение.Контрагент = Контрагент;
	//Движение.Сумма = СуммаДокумента;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, ЭтотОбъект.РучнаяКорректировка);
	
КонецПроцедуры

Функция ПолучитьТаблицуПринятыхКУчетуОС(СписокОС)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПринятыеКУчетуОССрезПоследних.ОсновноеСредство,
		|	ПринятыеКУчетуОССрезПоследних.ДатаВводаВЭксплуатацию
		|ИЗ
		|	РегистрСведений.ПринятыеКУчетуОС.СрезПоследних(&ДатаСреза, ОсновноеСредство В (&СписокОС)) КАК ПринятыеКУчетуОССрезПоследних";

	Запрос.УстановитьПараметр("ДатаСреза", Дата);
	Запрос.УстановитьПараметр("СписокОС", СписокОС);

	Возврат Запрос.Выполнить().Выгрузить();	

КонецФункции
